In [208]:
import pandas as pd
import seaborn as sns
import os

In [209]:
way = '/mnt/HC_Volume_18315164/home-jupyter/jupyter-v-novohatnij-29/shared/homeworks/python_ds_miniprojects/5_subsid/subsid/'
dirr = [i for i in os.listdir(way)]

In [210]:
df = pd.DataFrame()
for i in dirr[1:]:
    a = pd.read_csv(way + i, sep=';')
    df = pd.concat([df,a])

In [211]:
df = df.reset_index(drop=True)

In [212]:
df = df.dropna()

In [213]:
def plus_id(idi):
    idi = str(idi)
    if not idi.startswith('id'):
        return 'id' + idi
    return idi

In [214]:
df.SUBS_ID = df.SUBS_ID.apply(plus_id)

In [215]:
df

     SUBS_ID  FILIAL_ID  PROD_ID          ACT_DTTM
0  id4651830          1     1954  20-03-2020 14:59
1  id7646509          5     6431  19-03-2020 13:00
2  id7412683          4     3313  22-03-2020 17:25
3  id5416547          3     1743  17-03-2020 10:17
5  id8362218          7     9879  05-03-2020 11:42
6  id2185490          2     3210  16-03-2020 16:28
7  id5764122          3     1499  18-03-2020 15:44
8  id7642700          6     3020  15-03-2020 14:21
9  id1374509          2     5677  17-03-2020 11:48

In [216]:
prod_activations_logs = pd.read_csv(way+'prod_activations_logs.csv',sep = ';')
prod_activations_logs

     SUBS_ID  PROD_ID        START_DTTM          END_DTTM
1  id4651830     1954  20-03-2020 14:59  01-12-2020 00:00
5  id7646509     6431  19-03-2020 13:00  19-03-2020 13:03
2  id7461794     3310  20-03-2020 17:25  01-12-2020 00:00
3  id5416547     1743  17-03-2020 10:17  25-03-2020 11:00
4  id8238421     1859  01-03-2020 11:42  01-03-2020 11:43
3  id8641743     2752  20-03-2020 15:44  21-04-2020 15:44
2  id2185490     3210  16-03-2020 16:28  01-12-2020 00:00
6  id7642700     3020  15-03-2020 14:21  15-03-2020 23:42
2  id8741631     5677  19-03-2020 12:28  01-12-2020 00:00

In [217]:
df_new = df.merge(prod_activations_logs,on = ['SUBS_ID','PROD_ID'])
df_new

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM
0,id4651830,1,1954,20-03-2020 14:59,20-03-2020 14:59,01-12-2020 00:00
1,id7646509,5,6431,19-03-2020 13:00,19-03-2020 13:00,19-03-2020 13:03
2,id5416547,3,1743,17-03-2020 10:17,17-03-2020 10:17,25-03-2020 11:00
3,id2185490,2,3210,16-03-2020 16:28,16-03-2020 16:28,01-12-2020 00:00
4,id7642700,6,3020,15-03-2020 14:21,15-03-2020 14:21,15-03-2020 23:42

In [200]:
df_new['ACT_DTTM'] = pd.to_datetime(df_new['ACT_DTTM'])
df_new['END_DTTM'] = pd.to_datetime(df_new['END_DTTM'])
df_new['START_DTTM'] = pd.to_datetime(df_new['START_DTTM'])

In [218]:
df_new

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM
0,id4651830,1,1954,20-03-2020 14:59,20-03-2020 14:59,01-12-2020 00:00
1,id7646509,5,6431,19-03-2020 13:00,19-03-2020 13:00,19-03-2020 13:03
2,id5416547,3,1743,17-03-2020 10:17,17-03-2020 10:17,25-03-2020 11:00
3,id2185490,2,3210,16-03-2020 16:28,16-03-2020 16:28,01-12-2020 00:00
4,id7642700,6,3020,15-03-2020 14:21,15-03-2020 14:21,15-03-2020 23:42

In [219]:
df_new['START_DTTM'] = pd.to_datetime(df_new['START_DTTM'], format='%d-%m-%Y %H:%M')

In [220]:
df_new['END_DTTM'] = pd.to_datetime(df_new['END_DTTM'], format='%d-%m-%Y %H:%M')

In [221]:
df_new['ACT_DTTM'] = pd.to_datetime(df_new['ACT_DTTM'], format='%d-%m-%Y %H:%M')

In [222]:
df_new.dtypes

SUBS_ID               object
FILIAL_ID              int64
PROD_ID                int64
ACT_DTTM      datetime64[ns]
START_DTTM    datetime64[ns]
END_DTTM      datetime64[ns]
dtype: object

In [223]:
df_new['difference'] = df_new['END_DTTM']-df_new['START_DTTM']

In [224]:
df_new

,SUBS_ID,FILIAL_ID,PROD_ID,ACT_DTTM,START_DTTM,END_DTTM,difference
0,id4651830,1,1954,2020-03-20 14:59:00,2020-03-20 14:59:00,2020-12-01 00:00:00,255 days 09:01:00
1,id7646509,5,6431,2020-03-19 13:00:00,2020-03-19 13:00:00,2020-03-19 13:03:00,0 days 00:03:00
2,id5416547,3,1743,2020-03-17 10:17:00,2020-03-17 10:17:00,2020-03-25 11:00:00,8 days 00:43:00
3,id2185490,2,3210,2020-03-16 16:28:00,2020-03-16 16:28:00,2020-12-01 00:00:00,259 days 07:32:00
4,id7642700,6,3020,2020-03-15 14:21:00,2020-03-15 14:21:00,2020-03-15 23:42:00,0 days 09:21:00

In [225]:
df_new.difference > '5m'

0     True
1    False
2     True
3     True
4     True
Name: difference, dtype: bool